Задание 2.4

In [135]:
import pandas as pd

countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})

display(countries_df)

     country  population    square
0     Англия       56.29    133396
1     Канада       38.05   9984670
2        США      322.28   9826630
3     Россия      146.24  17125191
4    Украина       45.50    603628
5   Беларусь        9.50    207600
6  Казахстан       17.04   2724902

In [136]:
countries_df['density'] = countries_df['population'] / countries_df['square'] * 1e6

round(countries_df['density'].mean(), 2)

84.93

In [137]:
ufo_df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv')
display(ufo_df)

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

"City" — город, где был замечен НЛО;

"Colors Reported" — цвет объекта;

"Shape Reported" — форма объекта;

"State" — обозначение штата;

"Time" — время, когда был замечен НЛО (данные отсортированы от старых наблюдений к новым).

In [138]:
ufo_df['Time'] = pd.to_datetime(ufo_df['Time'])

In [139]:
delta = ufo_df[ufo_df['State'] == 'NV']['Time'].dt.date.diff()
delta.dt.days.mean()

68.92932862190813

# 6. Закрепление знаний
starttime — время начала поездки (дата, время);

stoptime — время окончания поездки (дата, время);

start station id — идентификатор стартовой стоянки;

start station name — название стартовой стоянки;

start station latitude, start station longitude — географическая широта и долгота стартовой стоянки;

end station id — идентификатор конечной стоянки;

end station name — название конечной стоянки;
end station latitude, end station longitude — географическая широта и долгота конечной стоянки;

bikeid — идентификатор велосипеда;

usertype — тип пользователя (Customer — клиент с подпиской на 24 часа или на три дня, Subscriber — подписчик с годовой арендой велосипеда);

birth year — год рождения клиента;

gender — пол клиента (0 — неизвестный, 1 — мужчина, 2 — женщина).

In [140]:
cb_data = pd.read_csv('data\citibike-tripdata.csv')
cb_df = cb_data.copy()
cb_df.head()

,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
0,2018-09-01 00:00:05.2690,2018-09-01 00:27:20.6340,252.0,MacDougal St & Washington Sq,40.732264,-73.998522,366.0,Clinton Ave & Myrtle Ave,40.693261,-73.968896,25577,Subscriber,1980,1
1,2018-09-01 00:00:11.2810,2018-09-01 00:02:23.4810,314.0,Cadman Plaza West & Montague St,40.693830,-73.990539,3242.0,Schermerhorn St & Court St,40.691029,-73.991834,34377,Subscriber,1969,0
2,2018-09-01 00:00:20.6490,2018-09-01 00:55:58.5470,3142.0,1 Ave & E 62 St,40.761227,-73.960940,3384.0,Smith St & 3 St,40.678724,-73.995991,30496,Subscriber,1975,1
3,2018-09-01 00:00:21.7460,2018-09-01 00:07:38.5830,308.0,St James Pl & Oliver St,40.713079,-73.998512,3690.0,Park Pl & Church St,40.713342,-74.009355,28866,Subscriber,1984,2
4,2018-09-01 00:00:27.3150,2018-09-01 02:21:25.3080,345.0,W 13 St & 6 Ave,40.736494,-73.997044,380.0,W 4 St & 7 Ave S,40.734011,-74.002939,20943,Customer,1994,1

In [141]:
round(cb_df['start station id'].mode()[0])

281

In [142]:
round(cb_df['bikeid'].mode()[0])

33887

In [143]:
round(cb_df['usertype'].value_counts(normalize=True), 2)

usertype
Subscriber    0.77
Customer      0.23
Name: proportion, dtype: float64

In [144]:
cb_df['gender'].value_counts()

gender
1    183582
2     74506
0     41912
Name: count, dtype: int64

In [145]:
cb_df = cb_df.drop(['start station id', 'end station id'], axis=1)
cb_df.shape[1]

12

In [146]:
cb_df['age'] = 2018 - cb_df['birth year']
cb_df = cb_df.drop(['birth year'], axis=1)

In [147]:
len(cb_df[cb_df['age'] > 60])

11837

In [148]:
cb_df['trip duration'] = pd.to_datetime(cb_df['stoptime']) - pd.to_datetime(cb_df['starttime'])

In [149]:
cb_df['trip duration'][3]

Timedelta('0 days 00:07:16.837000')

In [150]:
cb_df['dayofweek'] = pd.to_datetime(cb_df['starttime']).dt.dayofweek
cb_df['weekend'] = cb_df['dayofweek'].apply(lambda x: 1 if (x == 5 or x == 6) else 0)
cb_df.drop(['dayofweek'], axis=1, inplace=True)
cb_df[cb_df['weekend'] == 1].shape[0]

115135

In [151]:
time_of_day = pd.to_datetime(cb_df['starttime']).dt.hour
def get_time_of_day(t):
    if 0 <= t <= 6:
        return 'night'
    elif 6 < t <= 12:
        return 'morning'
    elif 12 < t <= 18:
        return 'day'
    else:
        return 'evening'
cb_df['time_of_day'] = time_of_day.apply(get_time_of_day)

In [156]:
round(cb_df[cb_df['time_of_day'] == 'day'].shape[0] / cb_df[cb_df['time_of_day'] == 'night'].shape[0])

9